#tap "gromgit/brewtils"

# Dev tooling
brew "mise"
brew "neovim"
brew "vim"

# Terminal
brew "tmux"

# CLI tools
brew "fzf"
brew "ripgrep"
brew "fd"
brew "unzip"
brew "zip"
brew "zfind"
brew "ag"
brew "stow"
brew "bat"
brew "cpulimit"

# Prompt improvement
brew "zoxide"
brew "eza"
brew "atuin"

# TUI tools
brew "yazi"
brew "tig"
brew "ncdu"
brew "ranger"
brew "taproom"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "lazyssh"
cask "lazyworktree"
tap "chmouel/lazyworktree", "https://github.com/chmouel/lazyworktree"

brew "btop"

brew "csvlens"
brew "chafa"

# AI tools
cask "claude-code"
cask "codex"
# cask "cursor-cli" # Disabled: current Homebrew cask installs a macOS bundle on Linux/WSL
brew "mistral-vibe"
brew "opencode"
brew "rtk"
